[{"model": "blog.topic", "pk": 1, "fields": {"title": "Account", "slug": "account", "body": "You can manage your Gegoo (merchant and consumer) account from the dashboard on your profile page. All Account related questions can be answered in this section, else you can complete the FAQ contact form and the site administrator will reply with the answer.", "created_at": "2019-12-23T22:11:51Z", "updated_at": "2019-12-23T22:11:51Z"}}, {"model": "blog.topic", "pk": 2, "fields": {"title": "Authentication", "slug": "authentication", "body": "", "created_at": "2019-12-24T18:09:41Z", "updated_at": "2019-12-24T18:09:41Z"}}, {"model": "blog.topic", "pk": 3, "fields": {"title": "Billing", "slug": "billing", "body": "Gegoo billing is a unique recurrent invoicing engine that customizes the way in which you can pay for the site membership during your tenure using the merchant services. Gegoo aims to give merchants the most flexibility when it comes to subscription renewal for liquidity easing.", "created_at": "2019-12-24T18:09:53Z", "updated_at": "2019-12-24T18:09:53Z"}}, {"model": "blog.topic", "pk": 4, "fields": {"title": "Payments", "slug": "payments", "body": "", "created_at": "2019-12-24T18:10:10Z", "updated_at": "2019-12-24T18:10:10Z"}}, {"model": "blog.topic", "pk": 5, "fields": {"title": "Merchant Refunds", "slug": "merchant-refunds", "body": "", "created_at": "2019-12-24T18:10:22Z", "updated_at": "2019-12-24T18:10:22Z"}}, {"model": "blog.question", "pk": 1, "fields": {"title": "Verifying Business Address", "topic": 1, "slug": "verifying-business-address", "body": "Gegoo customer obligations require complete merchant authentication and verification to ensure that the business owners are in fact operating in the location that they specify. To verify your business credentials automatically, please ensure that all the profile creation fields are filled out fully and correctly. For business credential info that Gegoo is not able to identify, please provide alternate documentation for proof of business operation.", "status": "draft", "created_at": "2019-12-23T22:30:31Z", "updated_at": "2019-12-23T22:30:31Z"}}, {"model": "blog.question", "pk": 2, "fields": {"title": "Change Merchant Account Owner", "topic": 1, "slug": "change-merchant-account-owner", "body": "There are a number of ways that a new account owner can be authticated and authorized to use the Gegoo services. The previous account owner will need to request a user change role per the contact form from the account page and specify that they would like to transfer ownership of their merchant account. The administrator will then validate the information and authorize the new user.", "status": "draft", "created_at": "2019-12-24T17:58:26Z", "updated_at": "2019-12-24T17:58:26Z"}}, {"model": "blog.question", "pk": 3, "fields": {"title": "Managing Gegoo Subscription", "topic": 3, "slug": "managing-gegoo-subscription", "body": "Gegoo will send recurring business invoices per the payment plan that is selected by the customer. The current subscription module has a base value of one month. This means that subscription billing shall be renewed monthly unless otherwise specified by the owner of the merchant subscription program.", "status": "draft", "created_at": "2019-12-25T13:51:24Z", "updated_at": "2019-12-25T13:51:24Z"}}, {"model": "blog.question", "pk": 4, "fields": {"title": "Subscriptions Using Apple Pay", "topic": 3, "slug": "subscriptions-using-apple-pay", "body": "For future reference there will be alternative payment methods available to Gegoo merchants to pay their subscription invoices. Gegoo aim to make all business accessible to the platform and therefore will integrate as much functionality as possible.", "status": "draft", "created_at": "2019-12-25T18:45:53Z", "updated_at": "2019-12-25T18:45:53Z"}}, {"model": "blog.question", "pk": 5, "fields": {"title": "Profile Security Breach", "topic": 2, "slug": "profile-security-breach", "body": "If you believe that an unauthorized security breach has happened to your account please contact the site administrator immediately following the initial inclination. Please reset your password and protect and information hat you feel is sensitive. Note: Gegoo does not store financially sensitive information, please refer to our terms and conditions to read more about data usage.", "status": "draft", "created_at": "2019-12-26T00:06:22Z", "updated_at": "2019-12-26T00:06:22Z"}}]